In [264]:
import pandas as pd

### Series

In [265]:
data = [1, 2, 3, 4, 5]

In [266]:
s = pd.Series(data)

In [267]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [268]:
index = ['linha ' + str(i) for i in range(5)] #Cria uma lista para o range de 5 cria series com nome linha+rangeFOR
index

['linha 0', 'linha 1', 'linha 2', 'linha 3', 'linha 4']

In [269]:
#passar essa variavel como indice da series
s = pd.Series(data = data, index = index)
#anteriormente criei o DATA que continha uma lista que ia de 1 a te 5
#depois criei outra lista onde tinha o texto linha+algo

In [270]:
s
#mostra a variavel como ficou apos montar a taabela

linha 0    1
linha 1    2
linha 2    3
linha 3    4
linha 4    5
dtype: int64

In [271]:
#criar um dicionario e passar para o pd.Series
dado = {'linha ' + str(i) : i + 1 for i in range(5)}
#concatenando linha+str e definindo como indice
#utilizando : como separador
#definindo i+1 como coluna
#de 0 até 4 para a variavel i

In [272]:
dado #que agora é um dicionario (reconhecido pelos {} )

{'linha 0': 1, 'linha 1': 2, 'linha 2': 3, 'linha 3': 4, 'linha 4': 5}

In [273]:
s = pd.Series(dado)

In [274]:
s

linha 0    1
linha 1    2
linha 2    3
linha 3    4
linha 4    5
dtype: int64

In [275]:
#pode inclusive fazer operaçoes nestas series
s1 = s + 2
s1

linha 0    3
linha 1    4
linha 2    5
linha 3    6
linha 4    7
dtype: int64

In [276]:
#posso somar series que tenham os mesmos padroes
s2 = s1 + s
s2

linha 0     4
linha 1     6
linha 2     8
linha 3    10
linha 4    12
dtype: int64

In [277]:
#transformando em tabela
s = pd.DataFrame(s)
s

         0
linha 0  1
linha 1  2
linha 2  3
linha 3  4
linha 4  5

In [278]:
#colocando nome na coluna que estava faltando
s.columns.name = 'c1'

In [279]:
s

c1       0
linha 0  1
linha 1  2
linha 2  3
linha 3  4
linha 4  5

### DataFrame

In [280]:
dado = [[1, 2, 3], 
        [4, 5, 6], 
        [7, 8, 9]]

dado
#criado uma lista com lista dentro

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [281]:
df1 = pd.DataFrame(dado)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [282]:
linha = ['linha ' + str(i) for i in range(3)]
linha

['linha 0', 'linha 1', 'linha 2']

In [283]:
#adicionar este rotulo na tabela DF que criamos
df1 = pd.DataFrame(dado, linha)

df1

         0  1  2
linha 0  1  2  3
linha 1  4  5  6
linha 2  7  8  9

In [284]:
#alterando as colunas 
coluna = ['Coluna ' + str(i) for i in range(3)]
coluna

['Coluna 0', 'Coluna 1', 'Coluna 2']

In [285]:
df1 = pd.DataFrame(dado, linha, coluna)

df1

         Coluna 0  Coluna 1  Coluna 2
linha 0         1         2         3
linha 1         4         5         6
linha 2         7         8         9

#### utilizando por meio de dicionario

In [286]:
dicio = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}
#perceba como o dicionario já cria uma tabela escrita

dicio #um dicionario dentro de outro dicionario

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [287]:
df2 = pd.DataFrame(dicio) #como todo o trabalho ja foi feito na estrutura do dicionario
                          #ao converter ja vem tudo pronto.

In [288]:
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

### Fazendo com tuplas ao inves de lista

In [289]:
tupla = [(1, 2, 3),
         (4, 5, 6),
         (7, 8, 9)]
tupla

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [290]:
df3 = pd.DataFrame(dado, linha, coluna) #faz o mesmo processo igual da lista.

df3 #como é a mesma coisa, aproveitei a programaçao da lista feita anteriormente

         Coluna 0  Coluna 1  Coluna 2
linha 0         1         2         3
linha 1         4         5         6
linha 2         7         8         9

### concatenar dataframes

In [291]:
df1[df1 > 0] = 'A' #Todos os dados da tabela 1 que forem maior que 1 serão convertidos em A

df1

        Coluna 0 Coluna 1 Coluna 2
linha 0        A        A        A
linha 1        A        A        A
linha 2        A        A        A

In [292]:
df2[df2 > 0] = 'B'

df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [293]:
df3[df3 > 0] = 'C'

df3

        Coluna 0 Coluna 1 Coluna 2
linha 0        C        C        C
linha 1        C        C        C
linha 2        C        C        C

In [295]:
#ferramenta de concatenaçao do pandas
df4 = pd.concat([df1, df2, df3])

df4 #aqui nao concatenou tao certo pois tem STR misturado com INT

        Coluna 0 Coluna 1 Coluna 2 Coluna0 Coluna1 Coluna2
linha 0        A        A        A     NaN     NaN     NaN
linha 1        A        A        A     NaN     NaN     NaN
linha 2        A        A        A     NaN     NaN     NaN
Linha0       NaN      NaN      NaN       B       B       B
Linha1       NaN      NaN      NaN       B       B       B
Linha2       NaN      NaN      NaN       B       B       B
linha 0        C        C        C     NaN     NaN     NaN
linha 1        C        C        C     NaN     NaN     NaN
linha 2        C        C        C     NaN     NaN     NaN

In [298]:
df4 = pd.concat([df1, df2, df3], axis = 1)

df4 #mudando a visualizaçao

,Coluna 0,Coluna 1,Coluna 2,Coluna0,Coluna1,Coluna2,Coluna 0,Coluna 1,Coluna 2
linha 0,A,A,A,NaN,NaN,NaN,C,C,C
linha 1,A,A,A,NaN,NaN,NaN,C,C,C
linha 2,A,A,A,NaN,NaN,NaN,C,C,C
Linha0,NaN,NaN,NaN,B,B,B,NaN,NaN,NaN
Linha1,NaN,NaN,NaN,B,B,B,NaN,NaN,NaN
Linha2,NaN,NaN,NaN,B,B,B,NaN,NaN,NaN

#### <font color="yellow"> Exercicio </font>

In [300]:
df1 = pd.DataFrame({'A': {'X': 1}, 'B': {'X': 2}})
df2 = pd.DataFrame({'C': {'X': 3}, 'D': {'X': 4}})
pd.concat([df1, df2])

     A    B    C    D
X  1.0  2.0  NaN  NaN
X  NaN  NaN  3.0  4.0

In [301]:
dados = [('A', 'B'), ('C', 'D')]
df = pd.DataFrame(dados, columns = ['L1', 'L2'],  index = ['C1', 'C2'])
df

   L1 L2
C1  A  B
C2  C  D

In [302]:
dados = [[1, 2, 3], [4, 5, 6]]
index = 'X,Y'.split(',')
columns = list('CBA')[::-1]
df = pd.DataFrame(dados, index, columns)
df

   A  B  C
X  1  2  3
Y  4  5  6

In [303]:
dados = {'A': {'X': 1, 'Y': 3}, 'B': {'X': 2, 'Y': 4}}
df = pd.DataFrame(dados)
df

   A  B
X  1  2
Y  3  4